{"":["--------------------------------------------------------------------------------------------","Copyright (c) Microsoft Corporation. All rights reserved.","Licensed under the MIT License. See License.txt in the project root for license information.","--------------------------------------------------------------------------------------------","Do not edit this file. It is machine generated."],"version":"1.0.0","contents":{"bundle":{"'{0}'":"'{0}'","'from' expected":"'từ' mong đợi","'in' expected":"'trong' mong đợi","'through' or 'to' expected":"'thông qua' hoặc 'đến' được mong đợi","\"store\" a boolean test for later evaluation in a guard or if().":"\"Lưu trữ\" một bài kiểm tra Boolean để đánh giá sau trong một người bảo vệ hoặc nếu ().","( expected":"( hy vọng",") expected":") hy vọng","[ expected":"[ hy vọng","] expected":"] hy vọng","{ expected":"{ hy vọng","{0}, '{1}'":"{0}, '{1}'","} expected":"} hy vọng","@font-face":"@Font-mặt","@font-face rule must define 'src' and 'font-family' properties":"@Quy tắc Font-Face phải xác định các thuộc tính 'src' và 'font-family'","@keyframes {0}":"@keyframes {0}","<undefined>":"<undefined>","A list of properties that are not validated against the `unknownProperties` rule.":"Một danh sách các thuộc tính không được xác nhận theo quy tắc 'không biết `.","absolute value of a number":"Giá trị tuyệt đối của một số","Adds quotes to a string.":"Thêm dấu ngoặc kép vào một chuỗi.","Also define the standard property '{0}' for compatibility":"Also define the standard property '{0}' for compatibility","Always define standard rule '@keyframes' when defining keyframes.":"Luôn xác định quy tắc tiêu chuẩn '@KeyFrames' khi xác định các khung chính.","Always include all vendor specific properties: Missing: {0}":"Always include all vendor specific properties: Missing: {0}","Always include all vendor specific rules: Missing: {0}":"Always include all vendor specific rules: Missing: {0}","Appends a single value onto the end of a list.":"Lối nối một giá trị duy nhất vào cuối danh sách.","Appends selectors to one another without spaces in between.":"Đưa bộ chọn cho nhau mà không có khoảng trống ở giữa.","arccosine - inverse of cosine function":"arccosine - nghịch đảo của chức năng cosin","arcsine - inverse of sine function":"arcsine - nghịch đảo của chức năng sin","arctangent - inverse of tangent function":"arctangent - nghịch đảo của chức năng tiếp tuyến","argument from '{0}'":"argument from '{0}'","at-rule or selector expected":"Quy tắc hoặc bộ chọn dự kiến","at-rule unknown":"không rõ quy tắc","Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.":"Tránh sử dụng! Quan trọng. Đó là một dấu hiệu cho thấy tính đặc hiệu của toàn bộ CSS đã vượt khỏi tầm kiểm soát và cần phải được tái cấu trúc.","Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.":"Tránh sử dụng 'float'. Phao dẫn đến CSS dễ vỡ dễ bị phá vỡ nếu một khía cạnh của bố cục thay đổi.","bind the evaluation of a ruleset to each member of a list.":"Liên kết việc đánh giá một quy tắc với mỗi thành viên của một danh sách.","calculates square root of a number":"Tính toán căn bậc hai của một số","Causes one or more rules to be emitted at the root of the document.":"Gây ra một hoặc nhiều quy tắc được phát ra từ gốc của tài liệu.","Changes one or more properties of a color.":"Thay đổi một hoặc nhiều thuộc tính của một màu.","Changes the alpha component for a color.":"Thay đổi thành phần alpha cho một màu.","Changes the hue of a color.":"Thay đổi màu sắc của một màu.","colon expected":"Đại tá mong đợi","Combines several lists into a single multidimensional list.":"Kết hợp một số danh sách vào một danh sách đa chiều duy nhất.","comma expected":"dấu phẩy dự kiến","condition expected":"điều kiện dự kiến","Converts a color into the format understood by IE filters.":"Chuyển đổi một màu thành định dạng được hiểu bởi các bộ lọc IE.","Converts a color to grayscale.":"Chuyển đổi một màu thành thang độ xám.","Converts a string to lower case.":"Chuyển đổi một chuỗi thành chữ thường.","Converts a string to upper case.":"Chuyển đổi một chuỗi thành trường hợp trên.","Converts a unitless number to a percentage.":"Chuyển đổi một số đơn vị thành một tỷ lệ phần trăm.","converts numbers from one type into another":"Chuyển đổi số từ loại này sang loại khác","converts to a %, e.g. 0.5 > 50%":"converts to a %, e.g. 0.5 > 50%","cosine function":"Hàm cosin","creates a #AARRGGBB":"Tạo một #aarrggbb","creates a color":"tạo ra một màu","Creates a Color from hue, saturation, and lightness values.":"Tạo một màu từ Huế, bão hòa và giá trị độ sáng.","Creates a Color from hue, saturation, lightness, and alpha values.":"Tạo ra một màu từ màu sắc, độ bão hòa, nhẹ và các giá trị alpha.","Creates a Color from hue, white, and black values.":"Tạo một màu từ các giá trị Huế, Trắng và Đen.","Creates a Color from lightness, a, and b values.":"Tạo một màu từ các giá trị nhẹ, A và B.","Creates a Color from lightness, chroma, and hue values.":"Tạo ra một màu từ độ sáng, màu sắc và các giá trị màu sắc.","Creates a Color from red, green, and blue values.":"Tạo một màu từ các giá trị màu đỏ, xanh lá cây và xanh dương.","Creates a Color from red, green, blue, and alpha values.":"Tạo một màu từ các giá trị màu đỏ, xanh lá cây, xanh dương và alpha.","Creates a Color from the hue, saturation, and lightness values of another Color.":"Tạo một màu từ màu sắc, độ bão hòa và giá trị độ sáng của màu khác.","Creates a Color from the hue, white, and black values of another Color.":"Tạo một màu từ các giá trị màu sắc, trắng và đen của một màu khác.","Creates a Color from the lightness, a, and b values of another Color.":"Tạo một màu từ các giá trị nhẹ, A và B của một màu khác.","Creates a Color from the lightness, chroma, and hue values of another Color.":"Tạo một màu từ độ sáng, sắc độ và các giá trị màu sắc của một màu khác.","Creates a Color from the red, green, and blue values of another Color.":"Tạo một màu từ các giá trị màu đỏ, xanh lá cây và xanh dương của một màu khác.","Creates a Color in a specific color space from red, green, and blue values.":"Tạo một màu trong một không gian màu cụ thể từ các giá trị đỏ, xanh lá cây và xanh dương.","Creates a Color in a specific color space from the red, green, and blue values of another Color.":"Tạo một màu trong một không gian màu cụ thể từ các giá trị màu đỏ, xanh lá cây và xanh dương của một màu khác.","CSS fix is outdated and can't be applied to the document.":"CSS Fix đã lỗi thời và không thể áp dụng cho tài liệu.","CSS Language Server":"Máy chủ ngôn ngữ CSS","css.builtin.lab":"css.builtin.lab","Defines complex operations that can be re-used throughout stylesheets.":"Xác định các hoạt động phức tạp có thể được sử dụng lại trong suốt các kiểu dáng.","Defines styles that can be re-used throughout the stylesheet with `@include`.":"Xác định các kiểu có thể được sử dụng lại trong toàn bộ bảng kiểu với `@bao gồm`.","Do not use duplicate style definitions":"Không sử dụng định nghĩa kiểu trùng lặp","Do not use empty rulesets":"Không sử dụng các quy tắc trống","Do not use width or height when using padding or border":"Không sử dụng chiều rộng hoặc chiều cao khi sử dụng đệm hoặc đường viền","dot expected":"Dot dự kiến","Dynamically calls a Sass function.":"Tự động gọi một chức năng SASS.","Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.":"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.","escape string content":"Escape Chuỗi nội dung","Exposes the details of Sass’s inner workings.":"Phơi bày các chi tiết về hoạt động bên trong của Sass.","expression expected":"Biểu thức được mong đợi","Extends $extendee with $extender within $selector.":"Extends $extendee with $extender within $selector.","Extracts a substring from $string.":"Extracts a substring from $string.","Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.":"Không áp dụng CSS Fix cho tài liệu. Vui lòng xem xét việc mở một vấn đề với các bước để tái tạo.","Finds the maximum of several numbers.":"Tìm mức tối đa của một số số.","Finds the minimum of several numbers.":"Tìm thấy tối thiểu của một số số.","first argument modulus second argument":"Mô đun đối số thứ nhất đối số thứ hai","first argument raised to the power of the second argument":"Đối số đầu tiên được đưa ra cho sức mạnh của đối số thứ hai","Fluidly scales one or more properties of a color.":"Chia tỷ lệ chất lỏng một hoặc nhiều thuộc tính của một màu.","Folding Region End":"Vùng gấp kết thúc","Folding Region Start":"Vùng gấp bắt đầu","For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.":"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.","generate a list spanning a range of values":"Tạo một danh sách trải rộng một loạt các giá trị","Generates new colors based on existing ones, making it easy to build color themes.":"Tạo màu mới dựa trên các màu hiện có, giúp dễ dàng xây dựng các chủ đề màu sắc.","Gets the blue component of a color.":"Nhận được thành phần màu xanh của một màu.","Gets the green component of a color.":"Nhận được thành phần màu xanh lá cây của một màu.","Gets the hue component of a color.":"Nhận được thành phần màu sắc của một màu.","Gets the lightness component of a color.":"Nhận được thành phần nhẹ của một màu.","Gets the opacity component of a color.":"Nhận được thành phần độ mờ của một màu.","Gets the red component of a color.":"Nhận được thành phần màu đỏ của một màu.","Gets the saturation component of a color.":"Nhận được thành phần bão hòa của một màu.","Hex colors must consist of three, four, six or eight hex numbers":"Màu sắc hex phải bao gồm ba, bốn, sáu hoặc tám số hex","identifier expected":"định danh dự kiến","identifier or variable expected":"định danh hoặc biến dự kiến","identifier or wildcard expected":"định danh hoặc ký tự đại diện dự kiến","IE hacks are only necessary when supporting IE7 and older":"IE hack chỉ cần thiết khi hỗ trợ IE7 trở lên","Import statements do not load in parallel":"Nhập báo cáo không tải song song","Includes the body if the expression does not evaluate to `false` or `null`.":"Bao gồm cơ thể nếu biểu thức không đánh giá thành `false 'hoặc` null`.","Includes the styles defined by another mixin into the current rule.":"Bao gồm các kiểu được xác định bởi một hỗn hợp khác vào quy tắc hiện tại.","Increases or decreases one or more components of a color.":"Tăng hoặc giảm một hoặc nhiều thành phần của một màu.","Inherits the styles of another selector.":"Kế thừa các kiểu của một bộ chọn khác.","inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'":"Khối nội tuyến bị bỏ qua do phao. Nếu 'float' có giá trị khác ngoài 'không', hộp được thả nổi và 'hiển thị' được coi là 'khối'","inlines a resource and falls back to `url()`":"nội dung một tài nguyên và rơi trở lại `url ()`","Insert url() Function":"Chèn hàm URL ()","Insert url() Functions":"Chèn các hàm URL ()","Inserts $insert into $string at $index.":"Inserts $insert into $string at $index.","Invalid number of parameters":"Số lượng tham số không hợp lệ","Joins together two lists into one.":"Tham gia cùng nhau hai danh sách thành một.","Lets you access and modify values in lists.":"Cho phép bạn truy cập và sửa đổi các giá trị trong danh sách.","Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.":"Tải một biểu định kiểu SASS và tạo ra các hỗn hợp, chức năng và biến có sẵn khi bảng kiểu này được tải với quy tắc @USE.","Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.":"Tải các hỗn hợp, chức năng và biến từ các bảng kiểu SASS khác dưới dạng 'mô -đun' và kết hợp CSS từ nhiều bảng kiểu lại với nhau.","Makes a color darker.":"Làm cho một màu tối hơn.","Makes a color less saturated.":"Làm cho một màu ít bão hòa hơn.","Makes a color lighter.":"Làm cho một màu sáng hơn.","Makes a color more opaque.":"Làm cho một màu sắc mờ hơn.","Makes a color more saturated.":"Làm cho một màu sắc bão hòa hơn.","Makes a color more transparent.":"Làm cho một màu trong suốt hơn.","Makes it easy to combine, search, or split apart strings.":"Làm cho nó dễ dàng để kết hợp, tìm kiếm hoặc tách các chuỗi.","Makes it possible to look up the value associated with a key in a map, and much more.":"Làm cho nó có thể tra cứu giá trị liên quan đến một khóa trong bản đồ và nhiều hơn nữa.","media query expected":"Truy vấn truyền thông mong đợi","Merges two maps together into a new map.":"Hợp nhất hai bản đồ với nhau thành một bản đồ mới.","Mix two colors together in a polar color space.":"Trộn hai màu với nhau trong một không gian màu cực.","Mix two colors together in a rectangular color space.":"Trộn hai màu với nhau trong một không gian màu hình chữ nhật.","Mixes two colors together.":"Trộn hai màu với nhau.","Nests selector beneath one another like they would be nested in the stylesheet.":"Bộ chọn tổ bên dưới nhau giống như chúng sẽ được lồng trong bảng kiểu.","No unit for zero needed":"Không cần đơn vị cho số không","number expected":"số lượng dự kiến","operator expected":"Nhà điều hành dự kiến","page directive or declaraton expected":"Chỉ thị trang hoặc Declaraton dự kiến","Parses a selector into the format returned by &.":"Phân tích một bộ chọn vào định dạng được trả về bởi &.","parses a string to a color":"phân tích một chuỗi thành một màu","percentage expected":"tỷ lệ phần trăm dự kiến","Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.":"In giá trị của một biểu thức vào luồng đầu ra lỗi tiêu chuẩn. Hữu ích cho việc gỡ lỗi các tập tin SASS phức tạp.","Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.":"In giá trị của một biểu thức vào luồng đầu ra lỗi tiêu chuẩn. Hữu ích cho các thư viện cần cảnh báo người dùng khấu hao hoặc phục hồi từ các lỗi sử dụng mixin nhỏ. Cảnh báo có thể được tắt với tùy chọn dòng lệnh `--quiet` hoặc tùy chọn`: SILE` SASS.","Property is ignored due to the display.":"Thuộc tính bị bỏ qua do hiển thị.","Property is ignored due to the display. With 'display: block', vertical-align should not be used.":"Thuộc tính bị bỏ qua do hiển thị. Với 'Hiển thị: khối', không nên sử dụng ALIGN dọc.","property value expected":"Giá trị tài sản dự kiến","Provides access to Sass’s powerful selector engine.":"Cung cấp quyền truy cập vào động cơ chọn mạnh mẽ của SASS.","Provides functions that operate on numbers.":"Cung cấp các chức năng hoạt động trên các số.","remove or change the unit of a dimension":"loại bỏ hoặc thay đổi đơn vị của một chiều","Removes quotes from a string.":"Xóa trích dẫn từ một chuỗi.","Rename to '{0}'":"Rename to '{0}'","Replaces $original with $replacement within $selector.":"Replaces $original with $replacement within $selector.","Replaces the nth item in a list.":"Thay thế mục thứ n trong một danh sách.","return `@color` 10% points darker":"trả về `@color` 10% điểm tối hơn","return `@color` 10% points less saturated":"Trả về `@color` 10% điểm ít bão hòa","return `@color` 10% points less transparent":"Trả về `@color` 10% điểm ít minh bạch hơn","return `@color` 10% points lighter":"trả về `@color` 10% điểm nhẹ hơn","return `@color` 10% points more saturated":"Trả về `@color` 10% điểm bão hòa hơn","return `@color` 10% points more transparent":"Trả về `@color` 10% điểm minh bạch hơn","return `@color` with 50% transparency":"Trả về `@color` với độ minh bạch 50%","return `@color` with a 10 degree larger in hue":"Trả về `@color` với Hue lớn hơn 10 độ","return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes":"Trả về `@darkcolor` nếu`@color1 là> 43% luma` return `@lightcolor`, xem ghi chú","return a mix of `@color1` and `@color2`":"Trả lại hỗn hợp `@color1` và`@color2`","returns a grey, 100% desaturated color":"trả về màu xám, 100% màu sắc không bão hòa","Returns a list of all keys in a map.":"Trả về một danh sách tất cả các khóa trong bản đồ.","Returns a list of all values in a map.":"Trả về một danh sách tất cả các giá trị trong bản đồ.","Returns a new map with keys removed.":"Trả về một bản đồ mới với các khóa bị xóa.","Returns a random number.":"Trả về một số ngẫu nhiên.","Returns a specific item in a list.":"Trả về một mục cụ thể trong một danh sách.","returns a value at the specified position in the list":"Trả về một giá trị tại vị trí được chỉ định trong danh sách","returns one of two values depending on a condition.":"Trả về một trong hai giá trị tùy thuộc vào một điều kiện.","returns pi":"trả lại pi","returns the `alpha` channel of `@color`":"Trả về kênh `alpha` của`@color`","returns the `blue` channel of `@color`":"Trả về kênh `blue` của`@color`","returns the `green` channel of `@color`":"Trả về kênh `Green` của`@color`","returns the `hue` channel of `@color` in the HSL space":"Trả về kênh `hue` của`@color` trong không gian HSL","returns the `hue` channel of `@color` in the HSV space":"Trả về kênh `Hue` của`@color` trong không gian HSV","returns the `lightness` channel of `@color` in the HSL space":"Trả về kênh `nhẹ 'của`@color` trong không gian HSL","returns the `luma` value (perceptual brightness) of `@color`":"Trả về giá trị `luma` (độ sáng nhận thức) của`@color`","returns the `red` channel of `@color`":"Trả về kênh `red` của`@color`","returns the `saturation` channel of `@color` in the HSL space":"Trả về kênh `saturation` của`@color` trong không gian HSL","returns the `saturation` channel of `@color` in the HSV space":"Trả về kênh `saturation` của`@color` trong không gian HSV","returns the `value` channel of `@color` in the HSV space":"Trả về kênh `value` của`@color` trong không gian HSV","Returns the absolute value of a number.":"Trả về giá trị tuyệt đối của một số.","Returns the complement of a color.":"Trả về phần bổ sung của một màu.","Returns the index of the first occurance of $substring in $string.":"Returns the index of the first occurance of $substring in $string.","Returns the inverse of a color.":"Trả về nghịch đảo của một màu.","Returns the keywords passed to a function that takes variable arguments.":"Trả về các từ khóa được truyền vào một hàm có các đối số biến.","Returns the length of a list.":"Trả về độ dài của một danh sách.","returns the lowest of one or more values":"Trả về thấp nhất của một hoặc nhiều giá trị","Returns the number of characters in a string.":"Trả về số lượng ký tự trong một chuỗi.","returns the number of elements in a value list":"Trả về số lượng phần tử trong danh sách giá trị","Returns the position of a value within a list.":"Trả về vị trí của một giá trị trong một danh sách.","Returns the separator of a list.":"Trả về phân tách của một danh sách.","Returns the simple selectors that comprise a compound selector.":"Trả về các bộ chọn đơn giản bao gồm một bộ chọn ghép.","Returns the string representation of a value as it would be represented in Sass.":"Trả về biểu diễn chuỗi của một giá trị vì nó sẽ được biểu diễn trong SASS.","Returns the type of a value.":"Trả về loại giá trị.","Returns the unit(s) associated with a number.":"Trả về (các) đơn vị được liên kết với một số.","Returns the value in a map associated with a given key.":"Trả về giá trị trong bản đồ được liên kết với một khóa đã cho.","Returns whether $super matches all the elements $sub does, and possibly more.":"Returns whether $super matches all the elements $sub does, and possibly more.","Returns whether a feature exists in the current Sass runtime.":"Trả về liệu một tính năng tồn tại trong thời gian chạy SASS hiện tại.","Returns whether a function with the given name exists.":"Trả về liệu một chức năng với tên đã cho tồn tại.","Returns whether a map has a value associated with a given key.":"Trả về liệu một bản đồ có giá trị liên quan đến một khóa nhất định.","Returns whether a mixin with the given name exists.":"Trả về liệu một bản phối với tên đã cho tồn tại.","Returns whether a number has units.":"Trả về xem một số có đơn vị.","Returns whether a variable with the given name exists in the current scope.":"Trả về liệu một biến với tên đã cho tồn tại trong phạm vi hiện tại.","Returns whether a variable with the given name exists in the global scope.":"Trả về liệu một biến với tên đã cho tồn tại trong phạm vi toàn cầu.","Returns whether two numbers can be added, subtracted, or compared.":"Trả về cho dù hai số có thể được thêm, trừ hoặc so sánh.","Rounds a number down to the previous whole number.":"Làm tròn một số xuống toàn bộ số trước.","rounds a number to a number of places":"Vòng một số đến một số nơi","Rounds a number to the nearest whole number.":"Làm tròn một số vào số toàn bộ gần nhất.","Rounds a number up to the next whole number.":"Làm tròn một số cho đến số toàn bộ tiếp theo.","rounds down to an integer":"tròn xuống một số nguyên","rounds up to an integer":"vòng lên đến một số nguyên","Sass documentation":"Tài liệu sass","selector expected":"bộ chọn dự kiến","Selector Specificity":"Tính đặc hiệu chọn","Selectors should not contain IDs because these rules are too tightly coupled with the HTML.":"Các bộ chọn không nên chứa ID vì các quy tắc này được kết hợp quá chặt với HTML.","semi-colon expected":"Semi-Colon mong đợi","sine function":"chức năng sin","string literal expected":"chuỗi theo nghĩa đen mong đợi","string replace":"Chuỗi thay thế","tangent function":"Hàm tiếp tuyến","term expected":"Thuật ngữ dự kiến","The universal selector (*) is known to be slow":"Bộ chọn phổ quát (*) được biết là chậm","Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.":"Ném giá trị của một biểu thức là một lỗi nghiêm trọng với dấu vết ngăn xếp. Hữu ích cho việc xác thực đối số cho mixin và chức năng.","Unifies two selectors to produce a selector that matches elements matched by both.":"Thống nhất hai bộ chọn để tạo một bộ chọn phù hợp với các yếu tố phù hợp với cả hai.","Unknown at-rule.":"Không rõ quy tắc.","unknown keyword":"Từ khóa không xác định","Unknown property: '{0}'":"Unknown property: '{0}'","Unknown property.":"Tài sản không xác định.","Unknown vendor specific property.":"Tài sản cụ thể của nhà cung cấp không xác định.","URI expected":"Uri dự kiến","uri or string expected":"URI hoặc chuỗi dự kiến","URL encodes a string":"URL mã hóa một chuỗi","variable name expected":"Tên biến dự kiến","variable value expected":"giá trị biến dự kiến","When using a vendor-specific prefix also include the standard property":"Khi sử dụng tiền tố dành riêng cho nhà cung cấp cũng bao gồm thuộc tính tiêu chuẩn","When using a vendor-specific prefix make sure to also include all other vendor-specific properties":"Khi sử dụng tiền tố dành riêng cho nhà cung cấp, hãy đảm bảo cũng bao gồm tất cả các thuộc tính cụ thể của nhà cung cấp","While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.":"Trong khi vòng lặp có một biểu thức và liên tục xuất ra các kiểu lồng nhau cho đến khi câu lệnh đánh giá là 'false'.","whitespace expected":"khoảng trắng dự kiến","wildcard expected":"Wildcard mong đợi"},"package":{"css.colorDecorators.enable.deprecationMessage":"css.colorDecorators.enable.deprecationMessage","css.completion.completePropertyWithSemicolon.desc":"css.completion.completePropertyWithSemicolon.desc","css.completion.triggerPropertyValueCompletion.desc":"css.completion.triggerPropertyValueCompletion.desc","css.customData.desc":"css.customData.desc","css.format.braceStyle.desc":"css.format.braceStyle.desc","css.format.enable.desc":"css.format.enable.desc","css.format.maxPreserveNewLines.desc":"css.format.maxPreserveNewLines.desc","css.format.newlineBetweenRules.desc":"css.format.newlineBetweenRules.desc","css.format.newlineBetweenSelectors.desc":"css.format.newlineBetweenSelectors.desc","css.format.preserveNewLines.desc":"css.format.preserveNewLines.desc","css.format.spaceAroundSelectorSeparator.desc":"css.format.spaceAroundSelectorSeparator.desc","css.hover.documentation":"css.hover.documentation","css.hover.references":"css.hover.references","css.lint.argumentsInColorFunction.desc":"css.lint.argumentsInColorFunction.desc","css.lint.boxModel.desc":"css.lint.boxModel.desc","css.lint.compatibleVendorPrefixes.desc":"css.lint.compatibleVendorPrefixes.desc","css.lint.duplicateProperties.desc":"css.lint.duplicateProperties.desc","css.lint.emptyRules.desc":"css.lint.emptyRules.desc","css.lint.float.desc":"css.lint.float.desc","css.lint.fontFaceProperties.desc":"css.lint.fontFaceProperties.desc","css.lint.hexColorLength.desc":"css.lint.hexColorLength.desc","css.lint.idSelector.desc":"css.lint.idSelector.desc","css.lint.ieHack.desc":"css.lint.ieHack.desc","css.lint.important.desc":"css.lint.important.desc","css.lint.importStatement.desc":"css.lint.importStatement.desc","css.lint.propertyIgnoredDueToDisplay.desc":"css.lint.propertyIgnoredDueToDisplay.desc","css.lint.universalSelector.desc":"css.lint.universalSelector.desc","css.lint.unknownAtRules.desc":"css.lint.unknownAtRules.desc","css.lint.unknownProperties.desc":"css.lint.unknownProperties.desc","css.lint.unknownVendorSpecificProperties.desc":"css.lint.unknownVendorSpecificProperties.desc","css.lint.validProperties.desc":"css.lint.validProperties.desc","css.lint.vendorPrefix.desc":"css.lint.vendorPrefix.desc","css.lint.zeroUnits.desc":"css.lint.zeroUnits.desc","css.title":"css.title","css.trace.server.desc":"css.trace.server.desc","css.validate.desc":"css.validate.desc","css.validate.title":"css.validate.title","description":"Sự miêu tả","displayName":"DisplayName","less.colorDecorators.enable.deprecationMessage":"less.colorDecorators.enable.deprecationMessage","less.completion.completePropertyWithSemicolon.desc":"less.completion.completePropertyWithSemicolon.desc","less.completion.triggerPropertyValueCompletion.desc":"less.completion.triggerPropertyValueCompletion.desc","less.format.braceStyle.desc":"less.format.braceStyle.desc","less.format.enable.desc":"less.format.enable.desc","less.format.maxPreserveNewLines.desc":"less.format.maxPreserveNewLines.desc","less.format.newlineBetweenRules.desc":"less.format.newlineBetweenRules.desc","less.format.newlineBetweenSelectors.desc":"less.format.newlineBetweenSelectors.desc","less.format.preserveNewLines.desc":"less.format.preserveNewLines.desc","less.format.spaceAroundSelectorSeparator.desc":"less.format.spaceAroundSelectorSeparator.desc","less.hover.documentation":"less.hover.documentation","less.hover.references":"less.hover.references","less.lint.argumentsInColorFunction.desc":"less.lint.argumentsInColorFunction.desc","less.lint.boxModel.desc":"less.lint.boxModel.desc","less.lint.compatibleVendorPrefixes.desc":"less.lint.compatibleVendorPrefixes.desc","less.lint.duplicateProperties.desc":"less.lint.duplicateProperties.desc","less.lint.emptyRules.desc":"less.lint.emptyRules.desc","less.lint.float.desc":"less.lint.float.desc","less.lint.fontFaceProperties.desc":"less.lint.fontFaceProperties.desc","less.lint.hexColorLength.desc":"less.lint.hexColorLength.desc","less.lint.idSelector.desc":"less.lint.idSelector.desc","less.lint.ieHack.desc":"less.lint.ieHack.desc","less.lint.important.desc":"less.lint.important.desc","less.lint.importStatement.desc":"less.lint.importStatement.desc","less.lint.propertyIgnoredDueToDisplay.desc":"less.lint.propertyIgnoredDueToDisplay.desc","less.lint.universalSelector.desc":"less.lint.universalSelector.desc","less.lint.unknownAtRules.desc":"less.lint.unknownAtRules.desc","less.lint.unknownProperties.desc":"less.lint.unknownProperties.desc","less.lint.unknownVendorSpecificProperties.desc":"less.lint.unknownVendorSpecificProperties.desc","less.lint.validProperties.desc":"less.lint.validProperties.desc","less.lint.vendorPrefix.desc":"less.lint.vendorPrefix.desc","less.lint.zeroUnits.desc":"less.lint.zeroUnits.desc","less.title":"less.title","less.validate.desc":"less.validate.desc","less.validate.title":"less.validate.title","scss.colorDecorators.enable.deprecationMessage":"scss.colorDecorators.enable.deprecationMessage","scss.completion.completePropertyWithSemicolon.desc":"scss.completion.completePropertyWithSemicolon.desc","scss.completion.triggerPropertyValueCompletion.desc":"scss.completion.triggerPropertyValueCompletion.desc","scss.format.braceStyle.desc":"scss.format.braceStyle.desc","scss.format.enable.desc":"scss.format.enable.desc","scss.format.maxPreserveNewLines.desc":"scss.format.maxPreserveNewLines.desc","scss.format.newlineBetweenRules.desc":"scss.format.newlineBetweenRules.desc","scss.format.newlineBetweenSelectors.desc":"scss.format.newlineBetweenSelectors.desc","scss.format.preserveNewLines.desc":"scss.format.preserveNewLines.desc","scss.format.spaceAroundSelectorSeparator.desc":"scss.format.spaceAroundSelectorSeparator.desc","scss.hover.documentation":"scss.hover.documentation","scss.hover.references":"scss.hover.references","scss.lint.argumentsInColorFunction.desc":"scss.lint.argumentsInColorFunction.desc","scss.lint.boxModel.desc":"scss.lint.boxModel.desc","scss.lint.compatibleVendorPrefixes.desc":"scss.lint.compatibleVendorPrefixes.desc","scss.lint.duplicateProperties.desc":"scss.lint.duplicateProperties.desc","scss.lint.emptyRules.desc":"scss.lint.emptyRules.desc","scss.lint.float.desc":"scss.lint.float.desc","scss.lint.fontFaceProperties.desc":"scss.lint.fontFaceProperties.desc","scss.lint.hexColorLength.desc":"scss.lint.hexColorLength.desc","scss.lint.idSelector.desc":"scss.lint.idSelector.desc","scss.lint.ieHack.desc":"scss.lint.ieHack.desc","scss.lint.important.desc":"scss.lint.important.desc","scss.lint.importStatement.desc":"scss.lint.importStatement.desc","scss.lint.propertyIgnoredDueToDisplay.desc":"scss.lint.propertyIgnoredDueToDisplay.desc","scss.lint.universalSelector.desc":"scss.lint.universalSelector.desc","scss.lint.unknownAtRules.desc":"scss.lint.unknownAtRules.desc","scss.lint.unknownProperties.desc":"scss.lint.unknownProperties.desc","scss.lint.unknownVendorSpecificProperties.desc":"scss.lint.unknownVendorSpecificProperties.desc","scss.lint.validProperties.desc":"scss.lint.validProperties.desc","scss.lint.vendorPrefix.desc":"scss.lint.vendorPrefix.desc","scss.lint.zeroUnits.desc":"scss.lint.zeroUnits.desc","scss.title":"scss.title","scss.validate.desc":"scss.validate.desc","scss.validate.title":"scss.validate.title"}}}